[
    {
        "text": "Cheektowaga woman orders $600 mobility scooter and receives cane instead; company erases website",
        "label": 0
    },
    {
        "text": "Ukraine to change flag colours after losing legal battle with Lidl",
        "label": 1
    },
    {
        "text": "Montana man pleads guilty to creating ‘giant hybrid sheep’",
        "label": 0
    },
    {
        "text": "Homeless man who dug up Seattle park with an excavator has now built a cabin there",
        "label": 0
    },
    {
        "text": "Man finds out migraines caused by brain tapeworms; undercooked bacon may be culprit",
        "label": 0
    },
    {
        "text": "Most terrifying ways the deep state is trying to destroy Donald Trump",
        "label": 1
    },
    {
        "text": "How will the typical inner London cow-owning home-based lathe-operator with two families fare in the budget?",
        "label": 1
    },
    {
        "text": "Exxon chief says public to blame for climate failures",
        "label": 0
    },
    {
        "text": "Republican blocks IVF bill because it could lead to 'Human-Animal chimeras'",
        "label": 0
    },
    {
        "text": "‘Game of Thrones’ bosses confirm film trilogy ending got blocked; AT&T execs asked them to shoot vertically so episodes could fit on phones",
        "label": 0
    },
    {
        "text": "Trump dehumanizes migrants by referring to them as Dons and Erics",
        "label": 1
    },
    {
        "text": "Christian Bale gains 450,000 pounds to play Sandworm in ‘Dune’ remake",
        "label": 1
    },
    {
        "text": "There never was a 'Kate', Palace admits",
        "label": 1
    },
    {
        "text": "Mexican president defends disclosing a reporter's phone number, saying the law doesn't apply to him",
        "label": 0
    },
    {
        "text": "No evidence that U.S. covered up existence of UFOs, Pentagon report says",
        "label": 0
    },
    {
        "text": "Gazan hopes to live long enough to see his children eat dinner",
        "label": 1
    },
    {
        "text": "Morbidly obese cat dies of adorable heart attack",
        "label": 1
    },
    {
        "text": "Man who shot Reagan performing concert in Connecticut",
        "label": 0
    },
    {
        "text": "A New Orleans magician says a Democratic operative paid him to make the fake Biden robocall",
        "label": 0
    },
    {
        "text": "Pet DNA company identifies human as canine",
        "label": 0
    },
    {
        "text": "Avast ordered to stop selling browsing data from its browsing privacy apps",
        "label": 0
    },
    {
        "text": "'Dogs welcome' only refers to middle-class dogs, businesses clarify",
        "label": 1
    },
    {
        "text": "Sasha Obama accused of nepotism after getting elected President of Armenia",
        "label": 1
    },
    {
        "text": "Supreme Court officially kicks off campaign to re-elect Trump",
        "label": 1
    },
    {
        "text": "Bruno Mars reportedly in $50 million of debt with MGM Casino after assuming cocktails were complimentary",
        "label": 1
    },
    {
        "text": "School principal in Japan fired for coffee theft, denied retirement pay",
        "label": 0
    },
    {
        "text": "Woman gives birth on park bench outside Quebec hospital after finding main doors locked",
        "label": 0
    },
    {
        "text": "New evidence finds Neil Armstrong mistakenly believed he discovered India after landing on moon",
        "label": 1
    },
    {
        "text": "Outrage as Cadbury’s decides to abandon Easter eggs for “Celebratory chocolate orbs”",
        "label": 1
    },
    {
        "text": "Thanos. Ernst Blofeld. Emperor Palpatine. And Sadiq Khan, most evil of them all",
        "label": 1
    },
    {
        "text": "Study finds more Americans commuting to work splattered on grill of F-150",
        "label": 1
    },
    {
        "text": "New Idaho bill would create $420 mandatory minimum fine for marijuana possession",
        "label": 0
    },
    {
        "text": "President Xi appointed to serve on San Francisco Elections Commission",
        "label": 1
    },
    {
        "text": "Removed Notre Dame scaffolding reveals construction crew accidentally built mosque",
        "label": 1
    },
    {
        "text": "Alito says he was right to fear that opponents of gay marriage would be treated as bigots",
        "label": 0
    },
    {
        "text": "Royal Family criticized for not altering photo of King Charles much more",
        "label": 1
    },
    {
        "text": "Omaha mayor admits city doesn’t have community spirit to withstand terrorist attack",
        "label": 1
    },
    {
        "text": "10,000 bees on police helicopter keep it from taking off",
        "label": 0
    },
    {
        "text": "New Trump fundraising email claims candidate needs $5 for bus to New Jersey so he can see ailing mother",
        "label": 1
    },
    {
        "text": "Annoying hospital beeps are causing hundreds of deaths a year",
        "label": 0
    },
    {
        "text": "Can a ‘Muslim’ lion, ‘Hindu’ lioness live together? An Indian zoo dilemma",
        "label": 0
    },
    {
        "text": "Layover that would save $39 requires spending 7 months living in Iowa City suburb",
        "label": 1
    },
    {
        "text": "Boeing tells airlines to check pilot seats after report that an accidental shift led plane to plunge",
        "label": 0
    },
    {
        "text": "Former funeral home owner arrested after a corpse lay in a hearse for 2 years",
        "label": 0
    },
    {
        "text": "U.S. airdrops rubble into Gaza",
        "label": 1
    },
    {
        "text": "U.S. Navy announces plan to phase out all wet activities",
        "label": 1
    },
    {
        "text": "Amazon tells warehouse workers to close their eyes and think happy thoughts",
        "label": 0
    },
    {
        "text": "Woman charged $1,010 for a single Subway sandwich, still waiting for solution",
        "label": 0
    },
    {
        "text": "Republican lawmakers call on Biden to delete campaign TikTok account",
        "label": 0
    },
    {
        "text": "Shirtless US Senate candidate submerges himself in Wisconsin lake, issues challenge to opponent",
        "label": 0
    },
    {
        "text": "'He's like family to everybody': Community rallies around Hamburg man after alligator was seized from his home",
        "label": 0
    },
    {
        "text": "Macy’s to close 150 stores as it focuses on Indonesian terrorist division",
        "label": 1
    },
    {
        "text": "NASA's Voyager 1 spacecraft is talking nonsense. Its friends on Earth are worried",
        "label": 0
    },
    {
        "text": "Tim Commerford on Rage Against the Machine’s rumored breakup: \"I don't know. I'm the bass player.\"",
        "label": 0
    },
    {
        "text": "NYTimes deploys 127 journalists to cover Joe Biden’s age",
        "label": 1
    },
    {
        "text": "Billionaires’ survivalist bunkers go absolutely bonkers with fiery moats and water cannons",
        "label": 0
    },
    {
        "text": "Scientists discover birds lied about being related to dinosaurs",
        "label": 1
    },
    {
        "text": "Russian not sure if he’ll even vote because ‘they’re all the bloody same’",
        "label": 1
    },
    {
        "text": "Blue Origin builds $8 billion barrel for Jeff Bezos to ride over Niagara Falls",
        "label": 1
    },
    {
        "text": "Why GB News having government politicians as news presenters is actually a real boon for the democratic process, by Sir Jacob Rees-Mogg",
        "label": 1
    },
    {
        "text": "The voting bloc that could decide the US election: Swifties",
        "label": 0
    },
    {
        "text": "Immigration down as foreigners finally do some research",
        "label": 1
    },
    {
        "text": "Man steals $90,000 U.S. in calculators from Target",
        "label": 0
    },
    {
        "text": "Four children horribly disfigured in authentic Wonka experience",
        "label": 1
    },
    {
        "text": "An Oklahoma judge who sent more than 500 texts during a murder trial resigns",
        "label": 0
    },
    {
        "text": "Nurse swapped in tap water for fentanyl, killing Oregon patient, lawsuit alleges",
        "label": 0
    },
    {
        "text": "Words besides ‘genocide’ U.S. news outlets use to describe genocide",
        "label": 1
    },
    {
        "text": "General Mills urged to take plastics out of Cheerios, soup, pasta, canned corn",
        "label": 0
    },
    {
        "text": "French study suggests one in five young people can't recognise a zucchini",
        "label": 0
    },
    {
        "text": "Indonesian flight veered off course after both pilots allegedly fell asleep in the cockpit",
        "label": 0
    },
    {
        "text": "Obama pops into Downing Street to return Breaking Bad DVDs",
        "label": 1
    },
    {
        "text": "A humble proposition for counteracting the effects of global warming by initiating a moderate nuclear conflict",
        "label": 1
    },
    {
        "text": "Deceitful woman deviously alters appearance to give illusion of youth, fertility",
        "label": 1
    },
    {
        "text": "Kellogg's CEO faces backlash for saying people should eat cereal for dinner to save money",
        "label": 0
    },
    {
        "text": "Dua Lipa fan calls cops as Nicki Minaj fan flies to his house to settle beef",
        "label": 0
    },
    {
        "text": "Jake Paul announces he is bringing gun with him to fight Mike Tyson",
        "label": 1
    },
    {
        "text": "Alabama Supreme Court rules frozen embryos are ‘children’",
        "label": 0
    },
    {
        "text": "Kari Lake clarifies stance on abortion: I don’t want it to cost me a Senate seat?",
        "label": 1
    },
    {
        "text": "Saudi Arabia’s first male humanoid robot’s ‘groping’ incident sparks debate",
        "label": 0
    },
    {
        "text": "Present Biden went to the border today for the grand opening",
        "label": 1
    },
    {
        "text": "Baseball’s ambitious plan to lower the median fan age to 70",
        "label": 1
    },
    {
        "text": "Emma Stone on phone with Louis Vuitton customer service for 4 hours trying to get refund on ripped gown",
        "label": 1
    },
    {
        "text": "Victims of their own success? NYC budget director says school menus were cut because too many kids were eating",
        "label": 0
    },
    {
        "text": "Poll finds only 19% of Americans believe country ready for competent president",
        "label": 1
    },
    {
        "text": "Plucky underdog Vladimir Putin expected to win Russian election",
        "label": 1
    },
    {
        "text": "Poorest families urged to ‘spend it wisely’ after Jeremy Hunt reveals National Insurance cut will gift them an extra 30p a day",
        "label": 1
    },
    {
        "text": "Burglary victims need to stop being hung up on possessions, say police",
        "label": 1
    },
    {
        "text": "Milei threatens to pee on all of Argentina's governors and shut down Congress",
        "label": 0
    },
    {
        "text": "As housing costs skyrocket, Sedona will allow workers to live in cars. Residents aren't happy",
        "label": 0
    },
    {
        "text": "Montreal man returns from vacation, gets letter from Quebec government saying he's dead",
        "label": 0
    },
    {
        "text": "Ja Rule barred from UK as 'not relevant'",
        "label": 1
    },
    {
        "text": "Ron Johnson sponsors Travis Scott’s Astroworld just to kill more Black people",
        "label": 1
    },
    {
        "text": "Nation surprised U.S. power grid hasn’t been shut down by hacker named Cyber Wolf",
        "label": 1
    },
    {
        "text": "Houston police chief apologizes after officers drop 264k cases due to lack of staff",
        "label": 0
    },
    {
        "text": "Nike lays off more than 1,500 people as CEO says ‘I ultimately hold myself and my leadership team accountable’",
        "label": 0
    },
    {
        "text": "Motorcyclist with \"Will Run\" license plate flees deputies at 145 MPH",
        "label": 0
    },
    {
        "text": "Woman fired for eating leftover sandwich found in UK company's meeting room",
        "label": 0
    },
    {
        "text": "Meghan accused of altering Kate’s photo",
        "label": 1
    },
    {
        "text": "Kamala Harris will host a marijuana reform event with Fat Joe",
        "label": 0
    },
    {
        "text": "Trump booed at FurryCon while hawking new $399 tail",
        "label": 1
    }
]